Revit 2027 API
BuiltInFailures.StairRampFailures.RampDoesntReach Property
 The ramp is not long enough to reach the top constraint. Change the slope or increase the length of the ramp.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RampDoesntReach { get; }
Public Shared ReadOnly Property RampDoesntReach As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RampDoesntReach {
	FailureDefinitionId^ get ();
}
static member RampDoesntReach : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace